podInterface/testCase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10;

deltaT          1;

writeControl    timeStep;

writeInterval   2;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    podInterface0
    {
        type            podInterface;

        // Where to load it from (if not already in solver)
        functionObjectLibs ("libPODAnalysis.so");

        outputControl   outputTime;//timeStep;

        outputInterval  1;

	fieldName p;
	
	resultName testModeP;

	timeStart 3;

	timeEnd  8;

	chunkNumber 3;

        writePrecision 16;

	orientation vertical;

	averaging wieghted;
    }
}

// ************************************************************************* //
